{
  "Index": {
    "heading": "Разрабатываю Frontend | мои инсайты и проекты",
    "paragraph": "Добро пожаловать на мой личный блог, где я делюсь своим путешествием в мире frontend-разработки! Я демонстрирую проекты, которые подчеркивают мои знания и навыки в создании увлекательных пользовательских интерфейсов и интерактивных веб-приложений.",
    "contact": "Напишите мне",
    "title": "Digital passport",
    "description": "Создание с нуля Проекта Digital passport"
  },
  "Navigation": {
    "About": "РЕЗЮМЕ"
  },
  "LocaleSwitcher": {
    "locale": "{locale, select, ru {🇷🇺} en {🇺🇸} other {Unknown}}"
  },
  "About": {
    "back": "← Назад на главную",
    "badge": "Cкачать CV",
    "date": "Пятница 21 Октября 2022",
    "title": "Обо мне",
    "subtitle": "Привет! Я Марат, разработчик программного обеспечения и предприниматель. Я изучаю и работаю над технологиями, которые помогают обычным людям исследовать удобно интернет. У меня также есть милая кошка. 😺",
    "heading": "Технологии",
    "techs": "Управление проектами"
  },
  "Article": {
    "name": "Марат Мусин",
    "occupation": "Программист",
    "posted": "Опубликовано:",
    "back": "← Назад на главную"
  },
  "dp": {
    "title": "Создание интерактивного опыта WebGL в Next.js",
    "date": "Пятница 21 Октября 2022",
    "badge": "Программирование",
    "subtitle": "Ещё больше интерактивности с 3D графическим рендерингом.",
    "postContent1": "Проект, над которым я работал, связан с заводом по производству весовых комплексов полного цикла. Самое увлекательное во взаимодействии с клиентом - это понять, что он хочет видеть в конечном продукте. Одной из основных задач приложения является контроль весов 24/7 с помощью мобильного приложения.",
    "postContent2": "Мы создали уникальную среду, которая позволяет клиентам определить, когда и где возникают сбои в работе весов. Для этого мы разработали 24 функции, которые логически объединены в три категории для удобства навигации.",
    "heading2": "Большая идея",
    "postContent3": "Одной из интересных реализаций в проекте является 3D модель визуализации. Изначально, клиент предоставил модель весов в формате .usdz для просмотра в дополненной реальности. Мы пришли к идее перенести эту модель на веб-платформу с добавлением различных функций и анимаций.",
    "postContent4": "Для этого я использовал three.js и другие библиотеки React для работы с 3D. Оптимизация 3D моделей оказалась отдельной важной задачей, где мы сталкивались с различными аспектами, такими как количество полигонов и масштабирование текстур.",
    "heading3": "Анимации feat 3D",
    "postContent5": "Для этого я использовал three.js и другие библиотеки React для работы с 3D. Оптимизация 3D моделей оказалась отдельной важной задачей, где мы сталкивались с различными аспектами, такими как количество полигонов и масштабирование текстур.",
    "postContent6": "Одной из ключевых особенностей этого приложения - показ работы тензодатчиков на 3D модели. Если датчик находится в нормальном состоянии, он подсвечивается зеленым, если же есть проблемы, то подсвечивается красным.",
    "postContent7": "После этого появляется новая задача: сделать визуально доступной модель и конкретные датчики клиенту. Я не стал мудрить и брать библиотеки такие как Theatre.js и написал все в useEffect и оно заработало:)",
    "postContent8": "Сначала проверяю через какое устройство сидит мой клиент. Вот тот самый state:"


  }
}
