{
  "Index": {
    "heading": "Разрабатываю Frontend | мои инсайты и проекты",
    "paragraph": "Добро пожаловать на мой личный блог, где я делюсь своим путешествием в мире frontend-разработки! Я демонстрирую проекты, которые подчеркивают мои знания и навыки в создании увлекательных пользовательских интерфейсов и интерактивных веб-приложений.",
    "contact": "telegram",
    "dp-title": "Digital passport",
    "dp-description": "Создание с нуля Проекта Digital passport",
    "event-loop-title": "Event Loop база",
    "event-loop-description": "Разбираем event loop в браузере",
    "button": "Подробнее"
  },
  "Navigation": {
    "About": "РЕЗЮМЕ"
  },
  "LocaleSwitcher": {
    "locale": "{locale, select, ru {🇷🇺} en {🇺🇸} other {Unknown}}"
  },
  "About": {
    "back": "← Назад на главную",
    "badge": "Cкачать CV",
    "date": "Пятница 21 Октября 2022",
    "title": "Обо мне",
    "subtitle": "Привет! Я Марат, разработчик программного обеспечения и предприниматель. Я изучаю и работаю над технологиями, которые помогают обычным людям исследовать удобно интернет. У меня также есть милая кошка. 😺",
    "heading": "Технологии",
    "techs": "Управление проектами"
  },
  "Article": {
    "name": "Марат Мусин",
    "occupation": "Программист",
    "posted": "Опубликовано:",
    "back": "← Назад на главную"
  },
  "dp": {
    "title": "Создание интерактивного опыта WebGL в Next.js",
    "date": "Пятница 21 Октября 2022",
    "badge": "Программирование",
    "subtitle": "Ещё больше интерактивности с 3D графическим рендерингом.",
    "postContent1": "Проект, над которым я работал, связан с заводом по производству весовых комплексов полного цикла. Самое увлекательное во взаимодействии с клиентом - это понять, что он хочет видеть в конечном продукте. Одной из основных задач приложения является контроль весов 24/7 с помощью мобильного приложения.",
    "postContent2": "Мы создали уникальную среду, которая позволяет клиентам определить, когда и где возникают сбои в работе весов. Для этого мы разработали 24 функции, которые логически объединены в три категории для удобства навигации.",
    "heading2": "Большая идея",
    "postContent3": "Одной из интересных реализаций в проекте является 3D модель визуализации. Изначально, клиент предоставил модель весов в формате .usdz для просмотра в дополненной реальности. Мы пришли к идее перенести эту модель на веб-платформу с добавлением различных функций и анимаций.",
    "postContent4": "Для этого я использовал three.js и другие библиотеки React для работы с 3D. Оптимизация 3D моделей оказалась отдельной важной задачей, где мы сталкивались с различными аспектами, такими как количество полигонов и масштабирование текстур.",
    "heading3": "Анимации feat 3D",
    "postContent5": "Для этого я использовал three.js и другие библиотеки React для работы с 3D. Оптимизация 3D моделей оказалась отдельной важной задачей, где мы сталкивались с различными аспектами, такими как количество полигонов и масштабирование текстур.",
    "postContent6": "Одной из ключевых особенностей этого приложения - показ работы тензодатчиков на 3D модели. Если датчик находится в нормальном состоянии, он подсвечивается зеленым, если же есть проблемы, то подсвечивается красным.",
    "postContent7": "После этого появляется новая задача: сделать визуально доступной модель и конкретные датчики клиенту. Я не стал мудрить и брать библиотеки такие как Theatre.js и написал все в useEffect и оно заработало:)",
    "postContent8": "Сначала проверяю через какое устройство сидит мой клиент. Вот тот самый state:"
  },
  "event-loop": {
    "title": "Как работает Event Loop за 7 минут",
    "date": "Пятница 11 Августа 2023",
    "badge": "JavaScript",
    "subtitle": "Давайте разберем Event loop - это база.",
    "postContent1": "Важно понимать, что цикл событий не является частью самого JS. Вот почему V8 используется в Chrome, и то же самое относится к Node.js. Однако цикл событий в браузере и в Node.js - это совершенно разные концепции и реализуются по-разному. Цикл событий - это отдельный механизм, который позволяет нам использовать модель неблокирующего ввода/вывода. Давайте рассмотрим это.",
    "postContent2": "Представьте, у нас нет цикла событий и нет асинхронного кода. В этом случае мы будем выполнять код JS построчно, шаг за шагом. Но теперь вопрос: Как мы можем сделать выполнение этого кода параллельным? Например, нам может потребоваться отправить запрос, ввести что-то в поле ввода и одновременно запустить анимацию на странице. Мы не хотим, чтобы код блокировался, и не хотим ждать ответа. Мы можем использовать цикл событий для решения этой проблемы.",
    "heading2": "Делегирование задач",
    "postContent3": "Задача состоит в том, чтобы сделать выполнение параллельным, чтобы действия на странице не блокировали работу других компонентов на странице. Для достижения этой цели нам нужен цикл событий и обработка асинхронного кода. Используя асинхронные операции, такие как обратные вызовы, промисы или async/await, мы можем делегировать задачи циклу событий. Когда асинхронная задача, например, HTTP-запрос, выполняется, другое выполнение кода может продолжаться без ожидания результата этого запроса.",
    "postContent4": "Когда результат готов, вызывается обратный вызов или разрешается промис, что позволяет коду продолжить выполнение с соответствующей обработкой ответа. Таким образом, мы можем достичь параллелизма и отзывчивости в наших программах на JS, делая их эффективными и способными обрабатывать несколько задач одновременно, не блокируясь при выполнении долгих операций. ",
    "heading3": "Стек вызовов, рекурсия, переполнение стека",
    "postContent5": "Давайте начнем с того, как асинхронный код работает с использованием цикла событий, шаг за шагом. За его обработку отвечает стек вызовов. Движок JS - V8 - управляет стеком вызовов, который можно представить как стопку книг. Когда нам нужно взять книгу, мы берем верхнюю книгу из стопки. И когда мы хотим добавить книгу, мы кладем её сверху. Стек вызовов работает аналогично, складывая функции в порядке, в котором они должны быть вызваны. Давайте начнем с рассмотрения самого простого примера.",
    "postContent6": "Рассмотрим более сложный сценарий. Здесь функции вложены друг в друга. Мы выполняем третью функцию, внутри которой вызывается вторая функция, а внутри второй функции вызывается первая функция. Когда все функции помещены в стек, первая функция, находящаяся на верхушке стека, выполняется первой, затем вторая, и, наконец, третья. Вот как работает стек.",
    "postContent7": "Рассмотрим более сложный случай на примере функции факториала. В этой функции есть базовый случай для выхода из рекурсивного цикла. Итак, изначально стек вызовов получает вызовы этой функции со значением: 5, затем 4 и так далее до 1. Функция будет выходить из стека вызовов поочередно от 1 до 5.",
    "postContent8": "Важно отметить один важный момент. Стек вызовов не является бесконечным. Это означает, что при определенных условиях он может быть переполнен, и приложение завершится аварийно.",
    "postContent9": "Если мы вызовем функцию факториала с очень большим числом, стек вызовов в конечном итоге переполнится, и приложение выдаст ошибку. Таким образом, стек вызовов ограничен количеством вызовов функций.",
    "heading4": "Очередь задач, Асинхронный код",
    "postContent10": "Что если мы хотим выполнить какое-либо действие через 3 секунды? Например, показать пользователю сообщение о возможности скидки. Давайте рассмотрим пример кода:",
    "postContent11": "В этом примере сначала выполняется первая функция. Затем 'setTimeout' добавляется в стек вызовов, но обратная функция, которую мы передали внутри него, не выполняется сразу. Эта функция обратного вызова не попадает в стек вызовов. Вместо этого она помещается в очередь задач. В нашем случае это анонимная стрелочная функция, которую мы передали. Этот обратный вызов помещается в очередь задач. Мы можем сказать, что он запомнен и зарегистрирован. Мы подробнее расскажем о том, как происходит регистрация, немного позже.",
    "postContent12": "Затем выполняется log('end'), и спустя 3 секунды после этого запускается стрелочная функция, внутри которой выводится сообщение.",
    "heading5": "Важно!",
    "postContent13": "Задачи из очереди задач выполняются только после того, как все функции в стеке вызовов были вызваны, то есть когда стек вызовов полностью пуст.",
    "heading6": "Задачи движка JS: куча (heap), стек вызовов",
    "postContent14": "Как же задачи попадают в очередь? Как мы уже выяснили, цикл событий отвечает за обработку очереди задач, тогда как движок JS, такой как V8, Spider Monkey и т. д., управляет стеком вызовов. Нам необходимо понять, какие задачи обрабатывает движок JS, а какие управляются циклом событий.",
    "postContent15": "Движок JS обрабатывает следующие задачи:",
    "postContent16": "1. Работа с кучей (heap) и стеком вызовов.",
    "postContent17": "2. Управление памятью, включая выделение памяти и сбор мусора.",
    "postContent18": "3. И основная задача - компиляция кода в машинный код.",
    "postContent19": "Таким образом, цикл событий не является частью движка JS, такого как V8. Цикл событий предоставляется средой браузера или Node.js. Структура цикла событий зависит от конкретной среды, в которой он используется. В Chrome и Node.js движок - это V8. Тем не менее, реализации их цикла событий могут отличаться.",
    "postContent20": "Теперь давайте разберем вопрос о том, как взаимодействуют между собой движок JS и цикл событий. Взаимодействие между движком JS и циклом событий происходит через следующие шаги:",
    "postContent21": "У каждого браузера есть веб-API. Это API предоставляет функциональности, такие как таймауты, слушатели событий, загрузка изображений и файлов, а также возможность отправки запросов fetch. Эти функциональности являются частью спецификации браузера, а не движка JS. Рассмотрим тот же пример с веб-API.",
    "postContent22": "После того как стек вызовов очищен, цикл событий берет обратный вызов из очереди задач и помещает его в стек вызовов для выполнения. Таким образом, поток выполнения будет следующим:",
    "postContent23": "Сначала выполняются все синхронные функции в стеке вызовов. Затем setTimeout регистрируется. По истечении времени соответствующий обратный вызов помещается в очередь задач. Теперь рассмотрим аналогичный пример, но с использованием слушателей событий. Точно так же addEventListener попадает в стек вызовов. После этого веб-API регистрирует слушатель событий для кнопки. То же самое происходит с второй кнопкой и так далее. Во время этого процесса наш интерфейс остается разблокированным. Когда мы нажимаем на эти кнопки, задачи генерируются в очереди задач. Как только все синхронные функции выполнены, цикл событий берет обратный вызов из очереди задач и помещает его в стек вызовов для выполнения. Другими словами, благодаря асинхронной модели мы можем иметь тысячи слушателей событий для кнопок, полей ввода, выпадающих списков и других элементов в нашем приложении одновременно. Эти события будут зарегистрированы в веб-API, пока мы явно не удалим их с помощью removeEventListener. Асинхронная модель позволяет обрабатывать события без блокировки основного потока, обеспечивая плавное взаимодействие пользователя.",
    "heading7": "Промисы, микротаски, макротаски",
    "postContent24": "Давайте представим, что наш код использует новый промис. Например, мы используем запрос fetch браузера для получения данных из базы данных, и он работает с использованием промисов. Вот пример: setTimeout вызывается с задержкой 0 мс. Теперь возникает вопрос: что выполнится быстрее, промис или setTimeout? Когда я ранее упомянул очередь задач, я не охватил тот факт, что на самом деле существует две очереди: очередь микрозадач (microtask queue) и очередь макрозадач (macrotask queue).",
    "postContent25": "У этих очередей есть определенные приоритеты, и цикл событий обрабатывает задачи определенным образом. В данный момент мы видим, что веб-API зарегистрировало setTimeout, а промис находится в стеке вызовов. Вот ключевой момент: промисы всегда отправляются в очередь микрозадач (microtask queue). В какой-то момент, когда достигнуто время нулевой задержки, обратный вызов внутри таймаута перемещается в очередь макрозадач (macrotask queue).",
    "postContent26": "Теперь вопрос: что выполнится быстрее? setTimeout или промис?",
    "postContent27": "Промис выполнится быстрее, и это связано с конкретным поведением цикла событий, который приоритезирует очередь микрозадач перед очередью макрозадач. Сначала выполняются все микрозадачи, а затем выполняется одна макрозадача.",
    "postContent28": "Теперь рассмотрим пример, в котором у нас есть несколько микрозадач и несколько макрозадач. Как цикл событий будет обрабатывать эти задачи? Цикл событий последовательно выполнит все микрозадачи. Когда очередь микрозадач становится пустой, он затем возьмет одну задачу из очереди макрозадач. Важно отметить, что одновременно выполняется только одна задача из очереди макрозадач."
  }
}
